Revit 2020 API
UnitUtils.GetTypeCatalogString Method (DisplayUnitType)
 Gets the string used in type catalogs to identify a given display unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static string GetTypeCatalogString(
	DisplayUnitType displayUnit
)
Visual Basic
Public Shared Function GetTypeCatalogString ( _
	displayUnit As DisplayUnitType _
) As String
Visual C++
public:
static String^ GetTypeCatalogString(
	DisplayUnitType displayUnit
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
Return Value
 The type catalog string, or an empty string if the display unit cannot be used in type catalogs.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitUtils Class
GetTypeCatalogString Overload
Autodesk.Revit.DB Namespace